Repository: sambar-fgfs/Kanboard-documentation-ja
Catalog: resource/kanboard-documentation-ja.tmx
Source language: en_us
Languages: ja

source: Almost the same thing as XML-RPC but with the JSON format.
ja: XML-RPC とほぼ同様ですが、JSON フォーマットを使用します。

source: - **type** (string, optional)
ja: - **type** (string, 任意)

source: You must have Postgresql installed on localhost.
ja: ローカルホスト上にPostgreSQLがインストールされている必要があります。

source: Here an example to change color of category labels:
ja: これは、カテゴリのラベルの色を変更する例です:

source: - **identifier** (alphanumeric string, required)
ja: - **identifier** (alphanumeric string, 必須)

source: - Purpose: **Get all necessary information to display a board**
ja: - 用途: **ボードに表示するのに必要な全ての情報を取得する**

source: - Forum: https://kanboard.discourse.group/
ja: - フォーラム: https://kanboard.discourse.group/

source: Request example to fetch all tasks on the board:
ja: ボード上の全てのタスクを取得するリクエストの例:

source: - Reset the search box = **r**
ja: - 検索ボックスをリセット = **r**

source: - Purpose: **Get all metadata related to a task by task unique id**
ja: - 用途: **タスクのユニークなIDからタスクに関連するメタデータを取得する**

source: You think something is not clear, there is grammatical errors, typos, anything.
ja: 何か分かりづらい事があったり、文法間違い、誤植、その他何でも気になる点があったなら。

source: - ``--group``: Group all overdue tasks for one user (from all projects) in one email
ja: - ``--group``: グループの全ての期限切れタスクを一人のユーザーに一通のEmailで送信する

source: Kanboard is translated in many languages.
ja: Kanboardは様々な言語に翻訳されています。

source: - Purpose: **Enable a user**
ja: - 用途: **ユーザーを有効化する**

source: Project views (Board, Calendar, List, Gantt) --------------------------------------------
ja: プロジェクトビュー (ボードビュー, カレンダー, リスト, ガントチャート) --------------------------------------------

source: - Install IIS on your server (Add a new role and don’t forget to enable CGI/FastCGI)
ja: - サーバーにIIS をインストールする (新しいロールを追加するとともに、 CGI/FastCGIを有効にするのを忘れないでください)

source: // By default Kanboard lowercase the ldap username to avoid duplicate users (the database is case sensitive) // Set to true if you want to preserve the case define('LDAP_USERNAME_CASE_SENSITIVE', false);
ja: // Kanboard はデフォルトではユーザーの重複回避のため、ldapのユーザー名は小文字になります (データベースは大文字と小文字を区別します ) // 大文字を使いたい場合はtrueにしてください。 define('LDAP_USERNAME_CASE_SENSITIVE', false);

source: - Column restrictions
ja: - カラムの制限

source: The timer can be started and stopped at any time.
ja: タイマーの開始と停止はいつでも行えます。

source: - Templates are written in pure PHP (don’t forget to escape data)
ja: - テンプレートは純粋なPHPで書かれています (エスケープのデータを忘れないでください)

source: - The time spent is calculated until the task is closed.
ja: - タスクがクローズされるまで経過時間を計算します。

source: - ``getEmail()``: Get user email address
ja: - ``getEmail()``: ユーザーのemailアドレスを取得する

source: - You have to be an administrator to be able to edit any users
ja: - 他のユーザーを編集できるようになるには、管理者になる必要があります。

source: This method works only with LDAP authentication configured in proxy or anonymous mode.
ja: この方法はLDAP認証が "proxy" モードか "anonymous" モードに設定されている場合のみ動作します。

source: - Find tasks with a reference: ``ref:1234`` or ``reference:TICKET-1234``
ja: - 外部参照IDで探す、: ``ref:1234`` か ``reference:TICKET-1234``

source: Secure HTTP headers settings ----------------------------
ja: セキュアHTTPヘッダのセクション ----------------------------

source: - Purpose: **Get an external task link**
ja: - 用途: **タスクの外部リンクを取得する**

source: :ref:`Be sure to read the instructions <bug-report>`
ja: :ref:`<bug-report>のインストラクションを参照してください。`

source: - ``myplugin`` is the name of your plugin (lowercase)
ja: - ``myplugin`` はあなたのプラグイン名 (小文字)

source: - Decompress the archive in ``C:\inetpub\wwwroot\kanboard``
ja: - ダウンロードしたアーカイブを``C:\inetpub\wwwroot\kanboard`` に展開する

source: - This calendar show tasks assigned to the user for all projects.
ja: - このカレンダーはユーザーに割当てられた全てのプロジェクトのタスクを表示します。

source: Go to **User profile > Public access**.
ja: **ユーザープロフィール > 公開アクセス** を参照してください。

source: When you click on the subtask title the status change:
ja: サブタスクのタイトルをクリックした時に、状態を変更します:

source: - Result on success: **Dictionary of user_id => user name**
ja: - 成功時の返り値: **Dictionary of user_id => user name**

source: The test suites are making real HTTP calls to the application that run inside a container.
ja: テストスイートはコンテナ内でアプリケーションを実行するために実際にHTTPコールを生成します。

source: - Attach and upload documents to the project.
ja: - プロジェクトに文書を添付・アップロードできます。

source: For example, you may want to create a custom role to force someone to follow a process.
ja: 例えば、誰かを強制的にプロセスに従わせるための独自の役割を作る事ができます。

source: - Find tasks with no category assigned: ``category:none``
ja: - カテゴリが割り当てられていないタスクを検索: ``category:none``

source: - Visualize your workflow
ja: - ワークフローの視覚化

source: Custom Routes =============
ja: カスタムルート =============

source: Backend Registration from Plugins ---------------------------------
ja: プラグインからバックエンドを登録する ---------------------------------

source: I get a blank page after installing or upgrading Kanboard ---------------------------------------------------------
ja: Kanboardをインストールorアップグレードした後に空白のページが表示される ---------------------------------------------------------

source: Frequently Asked Questions ==========================
ja: FAQ ==========================

source: - This chart is a graphical representation of work left to do versus time.
ja: - このチャートは時間経過と残りタスクを表わしています。

source: Plugin Development ==================
ja: プラグインの開発 ==================

source: - Result on success: **dictionary of project_id => project_name**
ja: - 成功時の返り値: **dictionary of project_id => project_name**

source: Group Helper ------------
ja: グループのヘルパー ------------

source: By default, boards are private, but it’s possible to make a board public.
ja: デフォルトではボードは非公開になっていますが、ボードを公開することもできます。

source: This setup require that you install additional software in your infrastructure.
ja: このセットアップには、あなたのインフラストラクチャーに追加のソフトウェアのインストールが必要です。

source: +-----------+----------------------------------------------------------+ | Type | Description | +===========+==========================================================+ | Local | User that stores his password in Kanboard’s database | | User | | +-----------+----------------------------------------------------------+ | Remote | User credentials are managed by another system (Example: | | User | LDAP server) | +-----------+----------------------------------------------------------+
ja: +-----------+----------------------------------------------------------+ | タイプ | 概要 | +===========+==========================================================+ | ローカル | Kanboardのデータベースにパスワードが保存されるユーザー | | ユーザー | | +-----------+----------------------------------------------------------+ | リモート | 別のシステムによって管理されるユーザー | | ユーザー | 例:LDAP サーバー) | +-----------+----------------------------------------------------------+

source: Only administrators have access to everything.
ja: システム管理者だけが全てにアクセスできます。

source: How to add new translated text in the application?
ja: 新しい翻訳文をアプリケーションに追加するにはどうすれば良いですか？

source: // Set to false to allow self-signed certificates
ja: // falseにすると、自己署名証明書を許容する

source: - Purpose: **Remove a user**
ja: - 用途: **ユーザーを削除する**

source: :alt: Subtask timer
ja: :alt: サブタスクのタイマー

source: How to find missing translations in the applications?
ja: アプリケーション内で未翻訳箇所を見つけるにはどうすれば良いですか？

source: - User management is available
ja: - ユーザー管理が利用可能です。

source: - Purpose: **Get projects of the connected user**
ja: - 用途: **接続したユーザーのプロジェクトを取得する**

source: For more information, read the `Sqlite documentation <https://sqlite.org/lang_vacuum.html>`__.
ja: 更なる情報は、`Sqlite documentation <https://sqlite.org/lang_vacuum.html>`__ を参照願います。

source: - Purpose: **Get one group**
ja: - 用途: **グループを取得する**

source: `Beanstalk <http://kr.github.io/beanstalkd/>`__ is a simple, fast work queue.
ja: `Beanstalk <http://kr.github.io/beanstalkd/>`__ はシンプルで、ワークキューが早いです。

source: +--------------+-------------------------------------------------------+ | Tag | Description | +==============+=======================================================+ | ``latest`` | Latest stable release | +--------------+-------------------------------------------------------+ | ``v1.2.x`` | Specific version of Kanboard | +--------------+-------------------------------------------------------+
ja: +--------------+-------------------------------------------------------+ | タグ | 概要 | +==============+=======================================================+ | latest | 最新の安定リリース | +--------------+-------------------------------------------------------+ | v1.2.x | Kanboardの特定バージョン | +--------------+-------------------------------------------------------+

source: - Result on success: **list of actions properties**
ja: - 成功時の返り値: **アクションのプロパティの一覧**

source: Our LDAP server is ``myserver.example.com`` and all users are stored under ``ou=People,dc=example,dc=com``.
ja: 我々のLDAPサーバーが ``myserver.example.com`` で、すべてのユーザー情報が ``ou=People,dc=example,dc=com`` に保存されているものとします。

source: - Purpose: **Get the application roles**
ja: - 用途: **アプリケーションでの役割を取得する**

source: Override HTTP Content Security Policy -------------------------------------
ja: HTTP コンテンツのセキュリティポリシーをオーバーライドする -------------------------------------

source: - Application role and project permissions are checked for each procedure
ja: - プロシージャ毎にアプリケーション上の役割と権限がチェックされます

source: Kanboard can delegate these tasks to a background worker that listen for incoming events.
ja: Kanboardはイベントを監視しているバックグラウンドワーカーにこれらのタスクを委任することができます。

source: - The container already include a custom config file located at ``/var/www/app/config.php``.
ja: - コンテナには ``/var/www/app/config.php``に、カスタム済みの設定ファイルがあります。

source: All tags can be managed in the project settings.
ja: 全てのタグはプロジェクト設定で管理されます。

source: Basic Usage ~~~~~~~~~~~
ja: 基本的な使用法 ~~~~~~~~~~~

source: user:reset-2fa Remove two-factor authentication for a user
ja: user:reset-2fa ユーザーの二要素認証を削除する

source: Example: ``description:"text search"``
ja: 例: ``description:"text search"``

source: - ``$default_values``: actual default values (array)
ja: - ``$default_values``: 実際のデフォルト値 (array)

source: Define new routes -----------------
ja: 新しいルートを定義する -----------------

source: - Debug file: ``debug.log`` (if debug mode is enabled with the ``file`` driver)
ja: - デバッグファイル: ``debug.log`` (デバッグモードが有効で、ドライバが ``file`` の場合)

source: Keys of the containers are unique across the application.
ja: コンテナのキーはアプリケーションにわたってユニークです。

source: // LDAP attribute for user avatar image: thumbnailPhoto or jpegPhoto define('LDAP_USER_ATTRIBUTE_PHOTO', '');
ja: // LDAP 属性のユーザーのアバター画像 : サムネイル写真 or Jpeg画像 define('LDAP_USER_ATTRIBUTE_PHOTO', '');

source: - ``getInternalId()``: Get internal database id, return 0 otherwise
ja: - ``getInternalId()``: 内部データベース上のIDを取得、もしくは0を返す

source: By default, emails will use the sender address ``notifications@kanboard.local``.
ja: デフォルトでは、送信者アドレスが``notifications@kanboard.local`` になっています。

source: Listen on hook events ~~~~~~~~~~~~~~~~~~~~~
ja: イベントのフックのリッスン ~~~~~~~~~~~~~~~~~~~~~

source: - Project Restrictions:
ja: - プロジェクトの制限:

source: Write your own CSS to override or improve Kanboard default style.
ja: Kanboardのデフォルトのスタイルを拡張、またはオーバーライドするために、自分でCSSを書くことができます。

source: notification:overdue-tasks Send notifications for overdue tasks
ja: notification:overdue-tasks 期限切れのタスクの通知を送る

source: Available commands: cronjob Execute daily cronjob help Displays help for a command job Execute individual job (read payload from stdin) list Lists commands version Display Kanboard version worker Execute queue worker db db:migrate Execute SQL migrations db:version Show database schema version export export:daily-project-column-stats Daily project column stats CSV export (number of tasks per column and per day) export:subtasks Subtasks CSV export export:tasks Tasks CSV export export:transitions Task transitions CSV export locale locale:compare Compare application translations with the fr_FR locale locale:sync Synchronize all translations based on the fr_FR locale notification notification:overdue-tasks Send notifications for overdue tasks plugin plugin:install Install a plugin from a remote Zip archive plugin:uninstall Remove a plugin plugin:upgrade Update all installed plugins projects projects:archive Disable projects not touched during one year projects:archive-activities Remove project activities after one year projects:daily-stats Calculate daily statistics for all projects trigger trigger:tasks Trigger scheduler event for all tasks user user:reset-2fa Remove two-factor authentication for a user user:reset-password Change user password
ja: 利用可能なコマンド: cronjob 毎日の cronjob を実行 help コマンドのヘルプを表示 job 個々のジョブを実行 (ペイロードは標準入力から読み込み) list コマンドのリストを表示 version Kanboard のバージョンを表示 worker キューワーカーを実行 データベース db:migrate SQL のマイグレーションを実行 db:version データベースのスキーマのバージョンを表示 エクスポート export:daily-project-column-stats 毎日のプロジェクトのコラムの統計を CSV でエクスポート (コラム毎・毎日のタスク数) export:subtasks サブタスクを CSV でエクスポート export:tasks タスクを CSV でエクスポート export:transitions タスクの遷移を CSV でエクスポート ロケール locale:compare アプリケーションの翻訳を fr_FR と比較 locale:sync 全ての翻訳を fr_FR を元に同期 通知 notification:overdue-tasks 期限切れタスクの通知を送る プラグイン plugin:install リモートの Zip アーカイブからプラグインをインストール plugin:uninstall プラグインを削除 plugin:upgrade インストール済みのプラグインをすべてアップデート プロジェクト projects:archive 1年間触られていないプロジェクトを無効化 projects:archive-activities 1年以上前のプロジェクトのアクティビティを削除 projects:daily-stats すべてのプロジェクトの毎日の統計を計算 trigger trigger:tasks Trigger scheduler event for all tasks user user:reset-2fa ユーザーの二要素認証を解除 user:reset-password ユーザーのパスワードを変更

source: - Attach log files
ja: - ログファイルを添付する

source: Add Notification Types with Plugins ===================================
ja: プラグインで通知のタイプを追加する ===================================

source: Plugin Registration File ------------------------
ja: プラグインの登録ファイル ------------------------

source: How does this work?
ja: どのように作動しますか?

source: Install ApacheMonitor ~~~~~~~~~~~~~~~~~~~~~
ja: ApacheMonitor のインストール ~~~~~~~~~~~~~~~~~~~~~

source: User interface ~~~~~~~~~~~~~~
ja: ユーザーインターフェース ~~~~~~~~~~~~~~

source: - Share your board with someone outside of your organization
ja: - 組織外の誰かとボードを共有する

source: figure:: /_static/board-view.png :alt: Board view
ja: figure:: /_static/board-view.png :alt: ボードビュー

source: - Do not forget to change the default user/password - Do not allow everybody to access the directory ``data`` from the URL.
ja: - デフォルトのユーザー名/パスワードから変更することを忘れない。 - ``data`` ディレクトリへはURLから誰でもアクセス出来るようにしてはならない。

source: - Purpose: **Get task by the unique id**
ja: - Purpose: **タスクをユニークなIDから取得する**

source: Kanboard uses this library `JSON-RPC <https://github.com/fguillot/JsonRPC>`__ to handle API calls.
ja: Kanboard は API 呼び出しのハンドルに `JSON-RPC <https://github.com/fguillot/JsonRPC>`__ ライブラリを使用しています。

source: The default relationships are:
ja: 既定の関係性:

source: Some parameters for the application can be changed on the settings page.
ja: 設定ページからいくつかのアプリケーションのパラメーターを変更できます。

source: Example with ``myplugin:dashboard/sidebar``:
ja: ``myplugin:dashboard/sidebar`` を例にとります:

source: - Heroku command line tools installed
ja: - Heroku コマンドラインツールがインストールされている

source: Time zone ~~~~~~~~~
ja: タイムゾーン ~~~~~~~~~

source: - Use only the opening tags ``<?php`` or ``<?=`` for templates, but **never** use ``<?``
ja: - 開始タグはテンプレートの ``<?php`` か ``<?=`` のみを使用し, ``<?`` は **決して**使用しない

source: - Purpose: **Get list of available events for actions**
ja: - 用途: **アクションに利用可能なイベントの一覧を取得する**

source: Running Kanboard with Docker ============================
ja: Docker上でKanboardを実行する ============================

source: Kanboard doesn’t work very well with `eAccelerator <http://eaccelerator.net>`__.
ja: Kanboardが `eAccelerator <http://eaccelerator.net>`__ と併用するとうまく動かない。

source: A specific user is used to browse the LDAP directory:
ja: 特定のユーザーをLDAPディレクトリのブラウズに使用します:

source: - If disabled, only open tasks will be included.
ja: - 無効の場合は、累積フロー図に含まれるのは未完了のタスクのみです。

source: Search by swimlane ~~~~~~~~~~~~~~~~~~
ja: スイムレーンで検索 ~~~~~~~~~~~~~~~~~~

source: Attribute: **started**
ja: 属性: **started**

source: - Respect the coding standards.
ja: - コーディング規約を尊重してください。

source: // Example for ActiveDirectory: (&(objectClass=group)(sAMAccountName=%s*))
ja: // ActiveDirectoryの例: (&(objectClass=group)(sAMAccountName=%s*))

source: Compatible Databases ~~~~~~~~~~~~~~~~~~~~
ja: 互換性のあるデータベース ~~~~~~~~~~~~~~~~~~~~

source: Search by comment ~~~~~~~~~~~~~~~~~
ja: コメントで検索 ~~~~~~~~~~~~~~~~~

source: - Check if you have installed all requirements on your server
ja: - サーバーに必要なものが全て入っているか確認する

source: - Open board switcher = **b**
ja: - 「別のプロジェクトを表示」プルダウンメニューを開く = **b**

source: By default, nothing is defined, so no links will be displayed.
ja: デフォルトでは何も設定されていないので、リンクは表示されません。

source: - Query to find closed tasks: ``status:closed``
ja: - 完了タスクを検索: ``status:closed``

source: Define the parameters
ja: パラメータを定義する

source: List of reference hooks:
ja: フックのリストの参照:

source: Adding Screenshots ------------------
ja: スクリーンショットを追加 ------------------

source: Some LDAP servers are configured for “LDAPS” connectivity only (on port 636).
ja: いくつかの LDAP サーバーは "LDAPS" 接続 (ポート:636) のみに設定されます。

source: Access is protected by a random token.
ja: アクセスはランダムなトークンにより保護されています。

source: I want to assign automatically a color to the user Bob ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
ja: ユーザー "Bob" に自動的に色を割り当てたい ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

source: Then, the link provider returns a object that implements the interface ``ExternalLinkInterface`` 4.
ja: その後リンクのプロバイダは ``ExternalLinkInterface``として実装されるオブジェクトを返します 4.

source: - A lot of meetings: planning, backlogs grooming, daily stand-up, retrospective
ja: - ミーティングが何度も必要: 計画立案、バックログ・グルーミング、デイリースタンドアップ(いわゆる「朝礼」？)、振り返り

source: In your ``php.ini``, change the following lines:
ja: ``php.ini`` の、以下の行を変更してください:

source: - Each column represents a step in your workflow
ja: - 各カラムは、ワークフローの中の段階を表します。

source: - Go to the task #123: **/t/123**
ja: - タスク #123 を表示: **/t/123**

source: - **date_started**: ISO8601 format (string, optional)
ja: - **date_started**: ISO8601 書式 (string, 任意)

source: - Avoid ambiguity, be explicit 5.
ja: - 曖昧さを避け、明確にする 5.

source: - Image thumbnails: ``files/thumbnails/*``
ja: - 画像サムネイル: ``files/thumbnails/*``

source: Enable/Disable debug mode -------------------------
ja: デバッグモードの有効化/無効化 -------------------------

source: - **blob** File content encoded in base64 (string, required)
ja: - **blob** ファイルの内容を base64 でエンコードした物(string, 必須)

source: - You can allow all network connections, for example ``setsebool -P httpd_can_network_connect=1`` or have a more restrictive rule
ja: - 全てのネットワーク接続を許容することができ、例えば ``setsebool -P httpd_can_network_connect=1`` か、それ以上の制限的なルールを持たせることができます。

source: - Purpose: **Remove a task**
ja: - 用途: **タスクを削除する**

source: Enable/disable plugin installation from the user interface:
ja: ユーザーインターフェースからのプラグインのインストールの有効化/無効化

source: - Purpose: **Get all available subtasks**
ja: - 用途: **全ての活動中のサブタスクを取得する**

source: - Sending emails via an external SMTP server can take several seconds
ja: - 外部SMTPサーバー経由でEMailを送信しているときに数秒の時間が掛かる

source: - People member of “Kanboard Admins” will have the role “Administrator”
ja: - “Kanboard Admins” のメンバーは、 “管理者” の役割を持ちます

source: - If you miss something, contribute to the project.
ja: - 何か的外れだと思うならば、プロジェクトに貢献してください。

source: note:: The recommended browsers are Mozilla Firefox or Google Chrome.
ja: 注意:: 推奨ブラウザはMozilla FirefoxかGoogle Chromeです。

source: - Decompress the archive in ``C:\Apache24\htdocs\kanboard``
ja: - ダウンロードしたアーカイブを``C:\Apache24\htdocs\kanboard`` に展開する

source: - Purpose: **Get all default task colors**
ja: - 用途: **全ての既定のタスクの色を取得する**

source: warning::
ja: 警告::

source: // LDAP username to use with proxy mode
ja: // proxyモードで使用する LDAP password

source: - Lower than: **due:<2015-06-29**
ja: - 指定日より前: **due:<2015-06-29**

source: - The Reverse-Proxy method implements ``PreAuthenticationProviderInterface`` and ``SessionCheckProviderInterface``
ja: - リバースプロキシのメソッドの実装は ``PreAuthenticationProviderInterface`` と ``SessionCheckProviderInterface`` です。

source: Copy the ``data`` folder into the newly uncompressed directory 3.
ja: ``data`` フォルダを新しく展開したディレクトリにコピーする 3.

source: Nginx Configuration Example ---------------------------
ja: Nginx での設定例 ---------------------------

source: SMTP Configuration ~~~~~~~~~~~~~~~~~~
ja: SMTP の設定 ~~~~~~~~~~~~~~~~~~

source: It’s also possible to use a secure connection, TLS or SSL:
ja: また、TLS か SSL による安全な接続も利用できます:

source: - Define action parameters: **Color = Green** and **Assignee = Bob**
ja: - アクションのパラメータ: **色 = グリーン** と **担当 = Bob** を定義

source: - Purpose: **Remove file**
ja: - 用途: **ファイルを削除する**

source: - `Microsoft IIS 5.1 and IIS 6.0 <http://php.net/manual/en/install.windows.iis6.php>`__
ja: - `Microsoft IIS 5.1 と IIS 6.0 <http://php.net/manual/en/install.windows.iis6.php>`__

source: Fill the form and save
ja: フォームを埋めて、保存してください。

source: Open the translation file ``app/Locale/xx_XX/translations.php`` 2.
ja: 翻訳ファイルを開く: ``app/Locale/xx_XX/translations.php`` 3.

source: How to translate the documentation?
ja: この文書を翻訳するには?

source: - Result on success: **action_id**
ja: - 成功時の返り値: **action_id**

source: - **password**: The password of your user must have at least 6 characters
ja: - **パスワード*: パスワードは最低でも6文字以上必要です。

source: Kanboard is an open source project with limited resources.
ja: Kanboardはリソースが限られたオープンソースプロジェクトです。

source: - Enable the debug mode and check the debug file ``data/debug.log``, you should see the exact error
ja: - デバッグモードを有効にし、 ``data/debug.log`` を確認して、エラーを正確に確認する

source: - Packaging
ja: - 梱包

source: - Find tasks by swim-lane: ``swimlane:"Version 42"``
ja: - スイムレーンで検索: ``swimlane:"Version 42"``

source: Class: ``Kanboard\Core\Ldap\Group``
ja: クラス: ``Kanboard\Core\Ldap\Group``

source: Acceptance Tests ----------------
ja: 受入テスト ----------------

source: Available commands ------------------
ja: 利用可能なコマンド ------------------

source: - Purpose: **Get the role of a user for a given project**
ja: - 用途: **プロジェクトでのユーザーの役割を取得する**

source: Using no blank line or no spaces at the end will render the text on the same line:
ja: 空の行や行末のスペースが無い場合、テキストは同じ行としてレンダリングされます:

source: Each view shows the result of the filter box at the top.
ja: 各々のビューは上部のフィルターボックスで処理した結果が表示されます。

source: - Customer Orders
ja: - 受注

source: // Escape html inside markdown text
ja: // markdownテキスト中でhtmlエスケープをさせる

source: figure:: /_static/project-remove.png :alt: Removing Projects
ja: figure:: /_static/project-remove.png :alt: プロジェクトの削除

source: - Purpose: **Remove a column**
ja: - 用途: **カラムの削除**

source: - ``initialize()``: Executed when the plugin is loaded
ja: - ``initialize()``: プラグインがロードされた時に実行される

source: // Set to true if you want to preserve the case
ja: // 大文字を使いたい場合はtrueにしてください。

source: Some features of Kanboard require that you run a daily background job.
ja: Kanboardのいくつかの特徴は、毎日のバックグラウンドジョブの実行を必要とします。

source: - Tests
ja: - 動作試験

source: - Execute ``vagrant plugin install vagrant-vbguest`` to install guest additions
ja: - ``vagrant plugin install vagrant-vbguest`` を実行してguest additionsをインストールする。

source: - **dependency** (string, required)
ja: - **dependency** (string, 必須)

source: - RSS Feed: https://github.com/kanboard/kanboard/releases.atom
ja: - RSS フィード: https://github.com/kanboard/kanboard/releases.atom

source: Override the value with a ``.htaccess``:
ja: ``.htaccess`` で値をオーバーライドする:

source: Note: When you make a project private, all existing users will still have access to the project.
ja: 注意: プライベートプロジェクトに変更した時に既にアクセス権があるユーザーは、依然としてアクセス権があります。

source: A custom role inherits from the project member role.
ja: 独自の役割は、プロジェクトメンバーの役割から継承されます。

source: In Kanboard, each user can be a member of one or many groups.
ja: Kanboardでは、各々のユーザーは一つ、あるいは複数のグループのメンバーになることができます。

source: - **label** (string, required)
ja: - **label** (string, 必須)

source: - You might need to enable PHP extensions with the command ``phpenmod``.
ja: - ``phpenmod`` コマンドでPHP拡張モジュールを有効にしなければなりません。

source: Editing Projects ----------------
ja: プロジェクトの編集 ----------------
